In [1]:
import pandas as pd

In [5]:
df1 = pd.read_excel('SalesData.xlsx')

In [13]:
"""        
1. Find th least amount sale that was done for each item
"""

df1.groupby('Item')['Sale_amt'].min()

Item
Cell Phone      3375.0
Desk             250.0
Home Theater    2000.0
Television      8386.0
Video Games      936.0
Name: Sale_amt, dtype: float64

In [18]:
"""        
2. Compute the total sales for each year and region across all items
"""
df1['Year'] = df1['OrderDate'].dt.year
df1.groupby(['Region', 'Year'])['Sale_amt'].sum()

Region   Year
Central  2018    479825.0
         2019    349944.5
East     2018    293780.0
         2019     27227.0
West     2018    105424.0
         2019     49475.0
Name: Sale_amt, dtype: float64

In [22]:
""" 
3. Create new column 'days_diff' with number of days difference between reference date passed and
each order date
"""

Reference_date = '2021-01-01'

df1['days_diff'] = (df1['OrderDate'] - pd.to_datetime(Reference_date)).dt.days
df1.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,Year,days_diff
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0,2018,-1091
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0,2018,-1074
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0,2018,-1057
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0,2018,-1040
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0,2018,-1023

In [24]:
"""        
4. Create a dataframe with two columns: 'manager', 'list_of_salesmen'. Column 'manager' will contain
the unique managers present and column 'list_of_salesmen' will contain an array of all salesmen under
each manager.
"""

df1.groupby('Manager')['SalesMan'].unique()

Manager
Douglas        [Michael, Karen, John]
Hermann         [Shelli, Luis, Sigal]
Martha     [Alexander, Steven, Diana]
Timothy              [David, Stephen]
Name: SalesMan, dtype: object

In [27]:
"""       
5. For all regions find number of salesman and total sales. Return as a dataframe with three columns -
Region, salesmen_count and total_sales
"""
# change nunique to unique to get names of salesmen
df1.groupby('Region').agg({'SalesMan':'nunique', 'Sale_amt':'sum'}).reset_index().rename(columns={'SalesMan':'salesmen_count', 'Sale_amt':'total_sales'})

    Region  salesmen_count  total_sales
0  Central               6     829769.5
1     East               3     321007.0
2     West               2     154899.0

In [28]:
"""       
6. Create a dataframe with total sales as percentage for each manager. Dataframe to contain manager
and percent_sales
"""

df1.groupby('Manager')['Sale_amt'].sum().reset_index().assign(percent_sales = lambda x: (x['Sale_amt']/x['Sale_amt'].sum())*100)

   Manager  Sale_amt  percent_sales
0  Douglas  239056.0      18.308990
1  Hermann  365108.5      27.963188
2   Martha  472493.0      36.187629
3  Timothy  229018.0      17.540193

In [39]:
df2 = pd.read_csv('imdb.csv')


"""
Was getting this error from the dataset provided in the question.

I continue to get this error for other lines even after fixing line 66.


---------------------------------------------------------------------------
ParserError                               Traceback (most recent call last)
Cell In[29], line 1
----> 1 df2 = pd.read_csv('imdb.csv')

File c:\Users\Hrsh Venket\miniconda3\envs\tiger-analytics\Lib\site-packages\pandas\io\parsers\readers.py:1026, in read_csv(filepath_or_buffer, sep, delimiter, header, names, index_col, usecols, dtype, engine, converters, true_values, false_values, skipinitialspace, skiprows, skipfooter, nrows, na_values, keep_default_na, na_filter, verbose, skip_blank_lines, parse_dates, infer_datetime_format, keep_date_col, date_parser, date_format, dayfirst, cache_dates, iterator, chunksize, compression, thousands, decimal, lineterminator, quotechar, quoting, doublequote, escapechar, comment, encoding, encoding_errors, dialect, on_bad_lines, delim_whitespace, low_memory, memory_map, float_precision, storage_options, dtype_backend)
   1013 kwds_defaults = _refine_defaults_read(
   1014     dialect,
   1015     delimiter,
   (...)
   1022     dtype_backend=dtype_backend,
   1023 )
   1024 kwds.update(kwds_defaults)
-> 1026 return _read(filepath_or_buffer, kwds)
...

File parsers.pyx:2061, in pandas._libs.parsers.raise_parser_error()

ParserError: Error tokenizing data. C error: Expected 44 fields in line 66, saw 46
"""

ParserError: Error tokenizing data. C error: Expected 44 fields in line 66, saw 46